notes/resources/docker/docker.org
#+TITLE: Docker
#+DATE: [2018-04-21 Sat 14:41]
#+AUTHOR: Damian Chrzanowski
#+EMAIL: pjdamian.chrzanowski@gmail.com
#+OPTIONS: H:2 toc:2
#+HTML_HEAD: <link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro" rel="stylesheet">
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../../assets/org.css"/>
#+HTML_HEAD: <link rel="icon" href="../../assets/favicon.ico">

[[file:../../index.org][Home Page]]

* Installation
  - Install the ~docker~ and ~docker-compose~ packages
  - Add the service
  #+BEGIN_SRC sh
  sudo systemctl start docker.service
  sudo systemctl enable docker.service
  #+END_SRC
  - Add yourself to the docker group, log out and log back in for the changes to take effect
  #+BEGIN_SRC sh
  sudo usermod -aG docker USERNAME
  #+END_SRC

* Important notes
  - The hostname ENV variable, is the name of the container when launched inside of the container

* Logging into Docker in the CLI
  #+BEGIN_SRC sh
  docker login
  #+END_SRC

* Commands
** Testing
   - Test installation
   #+BEGIN_SRC sh
  docker run hello-world
   #+END_SRC

** Help
   - Container help
   #+BEGIN_SRC sh
   docker container --help
   #+END_SRC
   - Image help
   #+BEGIN_SRC sh
   docker image --help
   #+END_SRC

** Listing
   - List images
   #+BEGIN_SRC sh
  docker image ls
   #+END_SRC
   - List containers, (running, all, all in quiet mode)
   #+BEGIN_SRC sh
  docker container ls
  docker container ls -a
  docker container ls -sq
   #+END_SRC

** Building
   - Build an image from the current directory, using a ~Dockerfile~, with a certain tag
   #+BEGIN_SRC sh
   docker build -t TAGNAME .
   #+END_SRC

** Running
   - Run the ~friendlyhello~ image with a port mapping from port ~80~ (in the container) to port ~4000~ (outside the container)
   #+BEGIN_SRC sh
   docker run -p 4000:80 friendlyhello
   #+END_SRC
   - Same as above but in detached mode
   #+BEGIN_SRC sh
   docker run -d -p 4000:80 friendlyhello
   #+END_SRC
   - Run from the cloud
   #+BEGIN_SRC sh
   docker run USERNAME/REPOSITORY:TAG
   #+END_SRC

** Stopping
   - Stop the container with the ID ~123456~
   #+BEGIN_SRC sh
   docker container stop 123456
   #+END_SRC

** Killing containers
   - Kill the container with the ID ~123456~
   #+BEGIN_SRC sh
   docker container kill 123456
   #+END_SRC

** Remove container/image
   - Remove the container/image with the ID ~123456~
   #+BEGIN_SRC sh
   docker container rm 123456
   docker image rm 123456
   #+END_SRC
   - Remove all containers/images
   #+BEGIN_SRC sh
   docker container rm $(docker container ls -a -q)
   docker image rm $(docker image ls -a -q)
   #+END_SRC

** Tagging
   - Tag an image
   #+BEGIN_SRC sh
   docker tag IMAGENAME USERNAME/REPOSITORY:TAGNAME
   #+END_SRC

** Pushing the image
   - Push the image
   #+BEGIN_SRC sh
   docker push USERNAME/TAGNAME
   #+END_SRC

* Sample Setup

** Sample Dockerfile
   - The ~Dockerfile~ itself
   #+BEGIN_SRC dockerfile
     # Use an official Python runtime as a parent image
     FROM python:2.7-slim

     # Set the working directory to /app
     WORKDIR /app

     # Copy the current directory contents into the container at /app
     ADD . /app

     # Install any needed packages specified in requirements.txt
     RUN pip install --trusted-host pypi.python.org -r requirements.txt

     # Make port 80 available to the world outside this container
     EXPOSE 80

     # Define environment variable
     ENV NAME World

     # Run app.py when the container launches
     CMD ["python", "app.py"]
   #+END_SRC

