notes/resources/docker/docker.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-07 Wed 22:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Docker</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Damian Chrzanowski" />
<link href="https://fonts.googleapis.com/css?family=Source+Sans+Pro" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="../../assets/org.css"/>
<link rel="icon" href="../../assets/favicon.ico">
</head>
<body>
<div id="content">
<h1 class="title">Docker</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org5a88b0d">1. Installation</a></li>
<li><a href="#org18cd61e">2. Important notes</a></li>
<li><a href="#orgbad096b">3. Logging into Docker in the CLI</a></li>
<li><a href="#org07a3771">4. Commands</a>
<ul>
<li><a href="#orgc658dba">4.1. Testing</a></li>
<li><a href="#org706c8ff">4.2. Help</a></li>
<li><a href="#orge411566">4.3. Listing</a></li>
<li><a href="#org55aa8e0">4.4. Building</a></li>
<li><a href="#org8855756">4.5. Running</a></li>
<li><a href="#orgf61d1de">4.6. Stopping</a></li>
<li><a href="#org01dfc41">4.7. Killing containers</a></li>
<li><a href="#orgb93f6d8">4.8. Remove container/image</a></li>
<li><a href="#org48216c3">4.9. Tagging</a></li>
<li><a href="#org0b5d52e">4.10. Pushing the image</a></li>
</ul>
</li>
<li><a href="#org1f3d125">5. Sample Setup</a>
<ul>
<li><a href="#org4dd15c0">5.1. Sample Dockerfile</a></li>
<li><a href="#org0446065">5.2. Sample Python Flask server</a></li>
<li><a href="#orgaa88097">5.3. Running the app</a></li>
<li><a href="#org33f4c9f">5.4. Login, tag the image, and push</a></li>
<li><a href="#org0bffc90">5.5. Now the image is available publicly and can be ran from any machine with</a></li>
</ul>
</li>
<li><a href="#orgd531ce9">6. Sample Setup with Docker-Compose</a>
<ul>
<li><a href="#org9f9151c">6.1. Create the dockerfile for the application</a></li>
<li><a href="#org474b91d">6.2. YML file that spins up the DB, waits for it and launches the app server</a></li>
<li><a href="#org7c78b08">6.3. wait-for-it bash script to wait for the db to spin up</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="../../index.html">Home Page</a>
</p>

<div id="outline-container-org5a88b0d" class="outline-2">
<h2 id="org5a88b0d"><span class="section-number-2">1</span> Installation</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Install the <code>docker</code> and <code>docker-compose</code> packages</li>
<li>Add the service</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">sudo systemctl start docker.service
sudo systemctl enable docker.service
</pre>
</div>
<ul class="org-ul">
<li>Add yourself to the docker group, log out and log back in for the changes to take effect</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">sudo usermod -aG docker USERNAME
</pre>
</div>
</div>
</div>

<div id="outline-container-org18cd61e" class="outline-2">
<h2 id="org18cd61e"><span class="section-number-2">2</span> Important notes</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>The hostname ENV variable, is the name of the container when launched inside of the container</li>
</ul>
</div>
</div>

<div id="outline-container-orgbad096b" class="outline-2">
<h2 id="orgbad096b"><span class="section-number-2">3</span> Logging into Docker in the CLI</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-sh">docker login
</pre>
</div>
</div>
</div>

<div id="outline-container-org07a3771" class="outline-2">
<h2 id="org07a3771"><span class="section-number-2">4</span> Commands</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgc658dba" class="outline-3">
<h3 id="orgc658dba"><span class="section-number-3">4.1</span> Testing</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Test installation</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker run hello-world
</pre>
</div>
</div>
</div>

<div id="outline-container-org706c8ff" class="outline-3">
<h3 id="org706c8ff"><span class="section-number-3">4.2</span> Help</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Container help</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker container --help
</pre>
</div>
<ul class="org-ul">
<li>Image help</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker image --help
</pre>
</div>
</div>
</div>

<div id="outline-container-orge411566" class="outline-3">
<h3 id="orge411566"><span class="section-number-3">4.3</span> Listing</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>List images</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker image ls
</pre>
</div>
<ul class="org-ul">
<li>List containers, (running, all, all in quiet mode)</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker container ls
docker container ls -a
docker container ls -sq
</pre>
</div>
</div>
</div>

<div id="outline-container-org55aa8e0" class="outline-3">
<h3 id="org55aa8e0"><span class="section-number-3">4.4</span> Building</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li>Build an image from the current directory, using a <code>Dockerfile</code>, with a certain tag</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker build -t TAGNAME .
</pre>
</div>
</div>
</div>

<div id="outline-container-org8855756" class="outline-3">
<h3 id="org8855756"><span class="section-number-3">4.5</span> Running</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li>Run the <code>friendlyhello</code> image with a port mapping from port <code>80</code> (in the container) to port <code>4000</code> (outside the container)</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker run -p 4000:80 friendlyhello
</pre>
</div>
<ul class="org-ul">
<li>Same as above but in detached mode</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker run -d -p 4000:80 friendlyhello
</pre>
</div>
<ul class="org-ul">
<li>Run from the cloud</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker run USERNAME/REPOSITORY:TAG
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf61d1de" class="outline-3">
<h3 id="orgf61d1de"><span class="section-number-3">4.6</span> Stopping</h3>
<div class="outline-text-3" id="text-4-6">
<ul class="org-ul">
<li>Stop the container with the ID <code>123456</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker container stop 123456
</pre>
</div>
</div>
</div>

<div id="outline-container-org01dfc41" class="outline-3">
<h3 id="org01dfc41"><span class="section-number-3">4.7</span> Killing containers</h3>
<div class="outline-text-3" id="text-4-7">
<ul class="org-ul">
<li>Kill the container with the ID <code>123456</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker container kill 123456
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb93f6d8" class="outline-3">
<h3 id="orgb93f6d8"><span class="section-number-3">4.8</span> Remove container/image</h3>
<div class="outline-text-3" id="text-4-8">
<ul class="org-ul">
<li>Remove the container/image with the ID <code>123456</code></li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker container rm 123456
docker image rm 123456
</pre>
</div>
<ul class="org-ul">
<li>Remove all containers/images</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker container rm $<span style="color: #fff0f5;">(</span><span style="color: #51afef; font-weight: bold;">docker</span> container ls -a -q<span style="color: #fff0f5;">)</span>
docker image rm $<span style="color: #fff0f5;">(</span><span style="color: #51afef; font-weight: bold;">docker</span> image ls -a -q<span style="color: #fff0f5;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org48216c3" class="outline-3">
<h3 id="org48216c3"><span class="section-number-3">4.9</span> Tagging</h3>
<div class="outline-text-3" id="text-4-9">
<ul class="org-ul">
<li>Tag an image</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker tag IMAGENAME USERNAME/REPOSITORY:TAGNAME
</pre>
</div>
</div>
</div>

<div id="outline-container-org0b5d52e" class="outline-3">
<h3 id="org0b5d52e"><span class="section-number-3">4.10</span> Pushing the image</h3>
<div class="outline-text-3" id="text-4-10">
<ul class="org-ul">
<li>Push the image</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker push USERNAME/TAGNAME
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org1f3d125" class="outline-2">
<h2 id="org1f3d125"><span class="section-number-2">5</span> Sample Setup</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org4dd15c0" class="outline-3">
<h3 id="org4dd15c0"><span class="section-number-3">5.1</span> Sample Dockerfile</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>The <code>Dockerfile</code> itself</li>
</ul>
<div class="org-src-container">
<pre class="src src-dockerfile"><span style="color: #5B6268;"># </span><span style="color: #5B6268;">Use an official Python runtime as a parent image</span>
<span style="color: #51afef; font-style: italic;">FROM</span> <span style="color: #ECBE7B; font-weight: bold;">python:2.7-slim</span>

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Set the working directory to /app</span>
<span style="color: #51afef; font-style: italic;">WORKDIR</span> /app

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Copy the current directory contents into the container at /app</span>
<span style="color: #51afef; font-style: italic;">ADD</span> . /app

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Install any needed packages specified in requirements.txt</span>
<span style="color: #51afef; font-style: italic;">RUN</span> pip install --trusted-host pypi.python.org -r requirements.txt

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Make port 80 available to the world outside this container</span>
<span style="color: #51afef; font-style: italic;">EXPOSE</span> 80

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Define environment variable</span>
<span style="color: #51afef; font-style: italic;">ENV</span> NAME World

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Run app.py when the container launches</span>
<span style="color: #51afef; font-style: italic;">CMD</span> <span style="color: #fff0f5;">[</span><span style="color: #98be65;">"python"</span>, <span style="color: #98be65;">"app.py"</span><span style="color: #fff0f5;">]</span>
</pre>
</div>
</div>
</div>
