notes/resources/docker/docker.org
** Sample Python Flask server
   - Additionally we create ~requirements.txt~ (python dependencies file)
   #+BEGIN_SRC text
   Flask
   Redis
   #+END_SRC
   - And the ~app.py~ for the app itself
   #+BEGIN_SRC python
     from flask import Flask
     from redis import Redis, RedisError
     import os
     import socket

     # Connect to Redis
     redis = Redis(host="redis", db=0, socket_connect_timeout=2, socket_timeout=2)

     app = Flask(__name__)

     @app.route("/")
     def hello():
         try:
             visits = redis.incr("counter")
         except RedisError:
             visits = "<i>cannot connect to Redis, counter disabled</i>"

         html = "<h3>Hello {name}!</h3>" \
                "<b>Hostname:</b> {hostname}<br/>" \
                "<b>Visits:</b> {visits}"
         return html.format(name=os.getenv("NAME", "world"), hostname=socket.gethostname(), visits=visits)

     if __name__ == "__main__":
         app.run(host='0.0.0.0', port=80)
   #+END_SRC

** Running the app
   - Build the image
   - ~-t~ to add a tag
   #+BEGIN_SRC sh
   docker build -t friendlyhello .
   #+END_SRC
   - Run the image. Add ~-d~ to run in detached mode
   #+BEGIN_SRC sh
   docker run -p 4000:80 friendlyhello
   #+END_SRC

** Login, tag the image, and push
   - Login
   #+BEGIN_SRC sh
   docker login
   #+END_SRC
   - Tag an image
   #+BEGIN_SRC sh
   docker tag friendlyhello:latest grimscythe/get-started:part2
   #+END_SRC
   - Push the image
   #+BEGIN_SRC sh
   docker push grimscythe/get-started:part2
   #+END_SRC

** Now the image is available publicly and can be ran from any machine with
   - Run it with
   #+BEGIN_SRC sh
   docker run -p 4000:80 grimscythe/get-started:part2
   #+END_SRC


* Sample Setup with Docker-Compose
  - run ~docker-compose up~ once everything is setup

** Create the dockerfile for the application
   #+BEGIN_SRC dockerfile
     FROM node:10.1.0

     WORKDIR /usr/src/app

     COPY package*.json ./

     RUN npm install typescript

     RUN npm install

     COPY . .

     EXPOSE 3000

     CMD ["npm", "run", "start:dev"]
   #+END_SRC

** YML file that spins up the DB, waits for it and launches the app server
   #+BEGIN_SRC yaml
     version: "3"
     services:
       app:
         build:
           context: .
           dockerfile: Dockerfile.app
         image: prefarm/arable
         depends_on:
           - db
         ports:
           - 8080:8081
         command: ["./wait-for-it.sh", "db:27017", "--", "nodemon"]
         volumes:
           - .:/usr/src/app
           - /usr/src/app/node_modules/
       db:
         build:
           context: .
           dockerfile: Dockerfile.db
         image: prefarm/db
         ports:
           - 27017:27017
         environment:
           MONGO_INITDB_DATABASE: Arable
   #+END_SRC

