notes/resources/docker/docker.html

<div id="outline-container-org0446065" class="outline-3">
<h3 id="org0446065"><span class="section-number-3">5.2</span> Sample Python Flask server</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Additionally we create <code>requirements.txt</code> (python dependencies file)</li>
</ul>
<div class="org-src-container">
<pre class="src src-text">Flask
Redis
</pre>
</div>
<ul class="org-ul">
<li>And the <code>app.py</code> for the app itself</li>
</ul>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef; font-style: italic;">from</span> flask <span style="color: #51afef; font-style: italic;">import</span> Flask
<span style="color: #51afef; font-style: italic;">from</span> redis <span style="color: #51afef; font-style: italic;">import</span> Redis, RedisError
<span style="color: #51afef; font-style: italic;">import</span> os
<span style="color: #51afef; font-style: italic;">import</span> socket

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Connect to Redis</span>
<span style="color: #bbc2cf; background-color: #131519;">redis</span> = Redis<span style="color: #fff0f5;">(</span><span style="color: #bbc2cf; background-color: #131519;">host</span>=<span style="color: #98be65;">"redis"</span>, <span style="color: #bbc2cf; background-color: #131519;">db</span>=<span style="color: #bbc2cf; background-color: #131519;">0</span>, <span style="color: #bbc2cf; background-color: #131519;">socket_connect_timeout</span>=<span style="color: #bbc2cf; background-color: #131519;">2</span>, <span style="color: #bbc2cf; background-color: #131519;">socket_timeout</span>=<span style="color: #bbc2cf; background-color: #131519;">2</span><span style="color: #fff0f5;">)</span>

<span style="color: #bbc2cf; background-color: #131519;">app</span> = Flask<span style="color: #fff0f5;">(</span><span style="color: #c678dd;">__name__</span><span style="color: #fff0f5;">)</span>

<span style="color: #51afef; font-style: italic;">@app.route</span><span style="color: #fff0f5;">(</span><span style="color: #98be65;">"/"</span><span style="color: #fff0f5;">)</span>
<span style="color: #51afef; font-style: italic;">def</span> <span style="color: #c678dd;">hello</span><span style="color: #fff0f5;">()</span>:
    <span style="color: #51afef; font-style: italic;">try</span>:
        <span style="color: #bbc2cf; background-color: #131519;">visits</span> = redis.incr<span style="color: #fff0f5;">(</span><span style="color: #98be65;">"counter"</span><span style="color: #fff0f5;">)</span>
    <span style="color: #51afef; font-style: italic;">except</span> RedisError:
        <span style="color: #bbc2cf; background-color: #131519;">visits</span> = <span style="color: #98be65;">"&lt;i&gt;cannot connect to Redis, counter disabled&lt;/i&gt;"</span>

    <span style="color: #bbc2cf; background-color: #131519;">html</span> = <span style="color: #98be65;">"&lt;h3&gt;Hello {name}!&lt;/h3&gt;"</span> \
           <span style="color: #98be65;">"&lt;b&gt;Hostname:&lt;/b&gt; {hostname}&lt;br/&gt;"</span> \
           <span style="color: #98be65;">"&lt;b&gt;Visits:&lt;/b&gt; {visits}"</span>
    <span style="color: #51afef; font-style: italic;">return</span> html.format<span style="color: #fff0f5;">(</span><span style="color: #bbc2cf; background-color: #131519;">name</span>=os.getenv<span style="color: #c678dd;">(</span><span style="color: #98be65;">"NAME"</span>, <span style="color: #98be65;">"world"</span><span style="color: #c678dd;">)</span>, <span style="color: #bbc2cf; background-color: #131519;">hostname</span>=socket.gethostname<span style="color: #c678dd;">()</span>, <span style="color: #bbc2cf; background-color: #131519;">visits</span>=visits<span style="color: #fff0f5;">)</span>

<span style="color: #51afef; font-style: italic;">if</span> <span style="color: #c678dd;">__name__</span> == <span style="color: #98be65;">"__main__"</span>:
    app.run<span style="color: #fff0f5;">(</span><span style="color: #bbc2cf; background-color: #131519;">host</span>=<span style="color: #98be65;">'0.0.0.0'</span>, <span style="color: #bbc2cf; background-color: #131519;">port</span>=<span style="color: #bbc2cf; background-color: #131519;">80</span><span style="color: #fff0f5;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaa88097" class="outline-3">
<h3 id="orgaa88097"><span class="section-number-3">5.3</span> Running the app</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li>Build the image</li>
<li><code>-t</code> to add a tag</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker build -t friendlyhello .
</pre>
</div>
<ul class="org-ul">
<li>Run the image. Add <code>-d</code> to run in detached mode</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker run -p 4000:80 friendlyhello
</pre>
</div>
</div>
</div>

<div id="outline-container-org33f4c9f" class="outline-3">
<h3 id="org33f4c9f"><span class="section-number-3">5.4</span> Login, tag the image, and push</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li>Login</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker login
</pre>
</div>
<ul class="org-ul">
<li>Tag an image</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker tag friendlyhello:latest grimscythe/get-started:part2
</pre>
</div>
<ul class="org-ul">
<li>Push the image</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker push grimscythe/get-started:part2
</pre>
</div>
</div>
</div>

<div id="outline-container-org0bffc90" class="outline-3">
<h3 id="org0bffc90"><span class="section-number-3">5.5</span> Now the image is available publicly and can be ran from any machine with</h3>
<div class="outline-text-3" id="text-5-5">
<ul class="org-ul">
<li>Run it with</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">docker run -p 4000:80 grimscythe/get-started:part2
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgd531ce9" class="outline-2">
<h2 id="orgd531ce9"><span class="section-number-2">6</span> Sample Setup with Docker-Compose</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>run <code>docker-compose up</code> once everything is setup</li>
</ul>
</div>

<div id="outline-container-org9f9151c" class="outline-3">
<h3 id="org9f9151c"><span class="section-number-3">6.1</span> Create the dockerfile for the application</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">
<pre class="src src-dockerfile"><span style="color: #51afef; font-style: italic;">FROM</span> <span style="color: #ECBE7B; font-weight: bold;">node:10.1.0</span>

<span style="color: #51afef; font-style: italic;">WORKDIR</span> /usr/src/app

<span style="color: #51afef; font-style: italic;">COPY</span> package*.json ./

<span style="color: #51afef; font-style: italic;">RUN</span> npm install typescript

<span style="color: #51afef; font-style: italic;">RUN</span> npm install

<span style="color: #51afef; font-style: italic;">COPY</span> . .

<span style="color: #51afef; font-style: italic;">EXPOSE</span> 3000

<span style="color: #51afef; font-style: italic;">CMD</span> <span style="color: #fff0f5;">[</span><span style="color: #98be65;">"npm"</span>, <span style="color: #98be65;">"run"</span>, <span style="color: #98be65;">"start:dev"</span><span style="color: #fff0f5;">]</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org474b91d" class="outline-3">
<h3 id="org474b91d"><span class="section-number-3">6.2</span> YML file that spins up the DB, waits for it and launches the app server</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #db5762;">version</span>: <span style="color: #98be65;">"3"</span>
<span style="color: #db5762;">services</span>:
  <span style="color: #db5762;">app</span>:
    <span style="color: #db5762;">build</span>:
      <span style="color: #db5762;">context</span>: .
      <span style="color: #db5762;">dockerfile</span>: Dockerfile.app
    <span style="color: #db5762;">image</span>: prefarm/arable
    <span style="color: #db5762;">depends_on</span>:
      - db
    <span style="color: #db5762;">ports</span>:
      - 8080:8081
    <span style="color: #db5762;">command</span>: [<span style="color: #98be65;">"./wait-for-it.sh"</span>, <span style="color: #98be65;">"db:27017"</span>, <span style="color: #98be65;">"--"</span>, <span style="color: #98be65;">"nodemon"</span>]
    <span style="color: #db5762;">volumes</span>:
      - .:/usr/src/app
      - /usr/src/app/node_modules/
  <span style="color: #db5762;">db</span>:
    <span style="color: #db5762;">build</span>:
      <span style="color: #db5762;">context</span>: .
      <span style="color: #db5762;">dockerfile</span>: Dockerfile.db
    <span style="color: #db5762;">image</span>: prefarm/db
    <span style="color: #db5762;">ports</span>:
      - 27017:27017
    <span style="color: #db5762;">environment</span>:
      <span style="color: #db5762;">MONGO_INITDB_DATABASE</span>: Arable
</pre>
</div>
</div>
</div>
