notes/resources/docker/docker.html

<div id="outline-container-org7c78b08" class="outline-3">
<h3 id="org7c78b08"><span class="section-number-3">6.3</span> wait-for-it bash script to wait for the db to spin up</h3>
<div class="outline-text-3" id="text-6-3">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #5B6268;">#</span><span style="color: #5B6268;">!/usr/bin/</span><span style="color: #51afef; font-style: italic;">env</span><span style="color: #5B6268;"> bash</span>
<span style="color: #5B6268;">#   </span><span style="color: #5B6268;">Use this script to test if a given TCP host/port are available</span>

<span style="color: #db5762;">cmdname</span>=$<span style="color: #fff0f5;">(</span><span style="color: #51afef; font-weight: bold;">basename</span> $<span style="color: #db5762;">0</span><span style="color: #fff0f5;">)</span>

<span style="color: #c678dd;">echoerr</span><span style="color: #fff0f5;">()</span> <span style="color: #fff0f5;">{</span> <span style="color: #51afef; font-style: italic;">if</span> <span style="color: #c678dd;">[</span><span style="color: #98be65;">[</span> $<span style="color: #db5762;">QUIET</span> -ne 1 <span style="color: #98be65;">]</span><span style="color: #c678dd;">]</span>; <span style="color: #51afef; font-style: italic;">then </span><span style="color: #c678dd;">echo</span> <span style="color: #98be65;">"$@"</span> 1&gt;&amp;2; <span style="color: #51afef; font-style: italic;">fi</span> <span style="color: #fff0f5;">}</span>

<span style="color: #c678dd;">usage</span><span style="color: #fff0f5;">()</span>
<span style="color: #fff0f5;">{</span>
    cat &lt;&lt; USAGE &gt;&amp;2
<span style="color: #98be65;">Usage:</span>
<span style="color: #98be65;">    $cmdname host:port [-s] [-t timeout] [-- command args]</span>
<span style="color: #98be65;">    -h HOST | --host=HOST       Host or IP under test</span>
<span style="color: #98be65;">    -p PORT | --port=PORT       TCP port under test</span>
<span style="color: #98be65;">                                Alternatively, you specify the host and port as host:port</span>
<span style="color: #98be65;">    -s | --strict               Only execute subcommand if the test succeeds</span>
<span style="color: #98be65;">    -q | --quiet                Don't output any status messages</span>
<span style="color: #98be65;">    -t TIMEOUT | --timeout=TIMEOUT</span>
<span style="color: #98be65;">                                Timeout in seconds, zero for no timeout</span>
<span style="color: #98be65;">    -- COMMAND ARGS             Execute command with args after the test finishes</span>
<span style="color: #98be65;">USAGE</span>
    <span style="color: #51afef; font-style: italic;">exit</span> 1
<span style="color: #fff0f5;">}</span>

<span style="color: #c678dd;">wait_for</span><span style="color: #fff0f5;">()</span>
<span style="color: #fff0f5;">{</span>
    <span style="color: #51afef; font-style: italic;">if</span> <span style="color: #c678dd;">[</span><span style="color: #98be65;">[</span> $<span style="color: #db5762;">TIMEOUT</span> -gt 0 <span style="color: #98be65;">]</span><span style="color: #c678dd;">]</span>; <span style="color: #51afef; font-style: italic;">then</span>
        echoerr <span style="color: #98be65;">"$cmdname: waiting $TIMEOUT seconds for $HOST:$PORT"</span>
    <span style="color: #51afef; font-style: italic;">else</span>
        echoerr <span style="color: #98be65;">"$cmdname: waiting for $HOST:$PORT without a timeout"</span>
    <span style="color: #51afef; font-style: italic;">fi</span>
    <span style="color: #db5762;">start_ts</span>=$<span style="color: #c678dd;">(</span><span style="color: #51afef; font-weight: bold;">date</span> +%s<span style="color: #c678dd;">)</span>
    <span style="color: #51afef; font-style: italic;">while</span> :
    <span style="color: #51afef; font-style: italic;">do</span>
        <span style="color: #51afef; font-style: italic;">if</span> <span style="color: #c678dd;">[</span><span style="color: #98be65;">[</span> $<span style="color: #db5762;">ISBUSY</span> -eq 1 <span style="color: #98be65;">]</span><span style="color: #c678dd;">]</span>; <span style="color: #51afef; font-style: italic;">then</span>
            nc -z $<span style="color: #db5762;">HOST</span> $<span style="color: #db5762;">PORT</span>
            <span style="color: #db5762;">result</span>=$<span style="color: #db5762;">?</span>
        <span style="color: #51afef; font-style: italic;">else</span>
            <span style="color: #c678dd;">(</span><span style="color: #c678dd;">echo</span> &gt; /dev/tcp/$<span style="color: #db5762;">HOST</span>/$<span style="color: #db5762;">PORT</span><span style="color: #c678dd;">)</span> &gt;/dev/null 2&gt;&amp;1
            <span style="color: #db5762;">result</span>=$<span style="color: #db5762;">?</span>
        <span style="color: #51afef; font-style: italic;">fi</span>
        <span style="color: #51afef; font-style: italic;">if</span> <span style="color: #c678dd;">[</span><span style="color: #98be65;">[</span> $<span style="color: #db5762;">result</span> -eq 0 <span style="color: #98be65;">]</span><span style="color: #c678dd;">]</span>; <span style="color: #51afef; font-style: italic;">then</span>
            <span style="color: #db5762;">end_ts</span>=$<span style="color: #c678dd;">(</span><span style="color: #51afef; font-weight: bold;">date</span> +%s<span style="color: #c678dd;">)</span>
            echoerr <span style="color: #98be65;">"$cmdname: $HOST:$PORT is available after $((end_ts - start_ts)) seconds"</span>
            <span style="color: #51afef; font-style: italic;">break</span>
        <span style="color: #51afef; font-style: italic;">fi</span>
        sleep 1
    <span style="color: #51afef; font-style: italic;">done</span>
    <span style="color: #51afef; font-style: italic;">return</span> $<span style="color: #db5762;">result</span>
<span style="color: #fff0f5;">}</span>

<span style="color: #c678dd;">wait_for_wrapper</span><span style="color: #fff0f5;">()</span>
<span style="color: #fff0f5;">{</span>
    <span style="color: #5B6268;"># </span><span style="color: #5B6268;">In order to support SIGINT during timeout: http://unix.stackexchange.com/a/57692</span>
    <span style="color: #51afef; font-style: italic;">if</span> <span style="color: #c678dd;">[</span><span style="color: #98be65;">[</span> $<span style="color: #db5762;">QUIET</span> -eq 1 <span style="color: #98be65;">]</span><span style="color: #c678dd;">]</span>; <span style="color: #51afef; font-style: italic;">then</span>
        timeout $<span style="color: #db5762;">BUSYTIMEFLAG</span> $<span style="color: #db5762;">TIMEOUT</span> $<span style="color: #db5762;">0</span> --quiet --child --host=$<span style="color: #db5762;">HOST</span> --port=$<span style="color: #db5762;">PORT</span> --timeout=$<span style="color: #db5762;">TIMEOUT</span> &amp;
    <span style="color: #51afef; font-style: italic;">else</span>
        timeout $<span style="color: #db5762;">BUSYTIMEFLAG</span> $<span style="color: #db5762;">TIMEOUT</span> $<span style="color: #db5762;">0</span> --child --host=$<span style="color: #db5762;">HOST</span> --port=$<span style="color: #db5762;">PORT</span> --timeout=$<span style="color: #db5762;">TIMEOUT</span> &amp;
    <span style="color: #51afef; font-style: italic;">fi</span>
    <span style="color: #db5762;">PID</span>=$<span style="color: #db5762;">!</span>
    <span style="color: #51afef; font-style: italic;">trap</span> <span style="color: #98be65;">"kill -INT -$PID"</span> INT
    <span style="color: #c678dd;">wait</span> $<span style="color: #db5762;">PID</span>
    <span style="color: #db5762;">RESULT</span>=$<span style="color: #db5762;">?</span>
    <span style="color: #51afef; font-style: italic;">if</span> <span style="color: #c678dd;">[</span><span style="color: #98be65;">[</span> $<span style="color: #db5762;">RESULT</span> -ne 0 <span style="color: #98be65;">]</span><span style="color: #c678dd;">]</span>; <span style="color: #51afef; font-style: italic;">then</span>
        echoerr <span style="color: #98be65;">"$cmdname: timeout occurred after waiting $TIMEOUT seconds for $HOST:$PORT"</span>
    <span style="color: #51afef; font-style: italic;">fi</span>
    <span style="color: #51afef; font-style: italic;">return</span> $<span style="color: #db5762;">RESULT</span>
<span style="color: #fff0f5;">}</span>

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">process arguments</span>
<span style="color: #51afef; font-style: italic;">while</span> <span style="color: #fff0f5;">[</span><span style="color: #c678dd;">[</span> $<span style="color: #db5762;">#</span> -gt 0 <span style="color: #c678dd;">]</span><span style="color: #fff0f5;">]</span>
<span style="color: #51afef; font-style: italic;">do</span>
    <span style="color: #51afef; font-style: italic;">case</span> <span style="color: #98be65;">"$1"</span><span style="color: #51afef; font-style: italic;"> in</span>
        *:* )
        <span style="color: #db5762;">hostport</span>=<span style="color: #fff0f5;">(</span>$<span style="color: #c678dd;">{</span><span style="color: #db5762;">1</span>//:/ <span style="color: #c678dd;">}</span><span style="color: #fff0f5;">)</span>
        <span style="color: #db5762;">HOST</span>=$<span style="color: #fff0f5;">{</span><span style="color: #db5762;">hostport</span><span style="color: #c678dd;">[</span>0<span style="color: #c678dd;">]</span><span style="color: #fff0f5;">}</span>
        <span style="color: #db5762;">PORT</span>=$<span style="color: #fff0f5;">{</span><span style="color: #db5762;">hostport</span><span style="color: #c678dd;">[</span>1<span style="color: #c678dd;">]</span><span style="color: #fff0f5;">}</span>
        <span style="color: #c678dd;">shift</span> 1
        ;;
        --child)
        <span style="color: #db5762;">CHILD</span>=1
        <span style="color: #c678dd;">shift</span> 1
        ;;
        -q | --quiet)
        <span style="color: #db5762;">QUIET</span>=1
        <span style="color: #c678dd;">shift</span> 1
        ;;
        -s | --strict)
        <span style="color: #db5762;">STRICT</span>=1
        <span style="color: #c678dd;">shift</span> 1
        ;;
        -h)
        <span style="color: #db5762;">HOST</span>=<span style="color: #98be65;">"$2"</span>
        <span style="color: #51afef; font-style: italic;">if</span> <span style="color: #fff0f5;">[</span><span style="color: #c678dd;">[</span> $<span style="color: #db5762;">HOST</span> == <span style="color: #98be65;">""</span> <span style="color: #c678dd;">]</span><span style="color: #fff0f5;">]</span>; <span style="color: #51afef; font-style: italic;">then break</span>; <span style="color: #51afef; font-style: italic;">fi</span>
        <span style="color: #c678dd;">shift</span> 2
        ;;
        --host=*)
        <span style="color: #db5762;">HOST</span>=<span style="color: #98be65;">"${1#*=}"</span>
        <span style="color: #c678dd;">shift</span> 1
        ;;
        -p)
        <span style="color: #db5762;">PORT</span>=<span style="color: #98be65;">"$2"</span>
        <span style="color: #51afef; font-style: italic;">if</span> <span style="color: #fff0f5;">[</span><span style="color: #c678dd;">[</span> $<span style="color: #db5762;">PORT</span> == <span style="color: #98be65;">""</span> <span style="color: #c678dd;">]</span><span style="color: #fff0f5;">]</span>; <span style="color: #51afef; font-style: italic;">then break</span>; <span style="color: #51afef; font-style: italic;">fi</span>
        <span style="color: #c678dd;">shift</span> 2
        ;;
        --port=*)
        <span style="color: #db5762;">PORT</span>=<span style="color: #98be65;">"${1#*=}"</span>
        <span style="color: #c678dd;">shift</span> 1
        ;;
        -t)
        <span style="color: #db5762;">TIMEOUT</span>=<span style="color: #98be65;">"$2"</span>
        <span style="color: #51afef; font-style: italic;">if</span> <span style="color: #fff0f5;">[</span><span style="color: #c678dd;">[</span> $<span style="color: #db5762;">TIMEOUT</span> == <span style="color: #98be65;">""</span> <span style="color: #c678dd;">]</span><span style="color: #fff0f5;">]</span>; <span style="color: #51afef; font-style: italic;">then break</span>; <span style="color: #51afef; font-style: italic;">fi</span>
        <span style="color: #c678dd;">shift</span> 2
        ;;
        --timeout=*)
        <span style="color: #db5762;">TIMEOUT</span>=<span style="color: #98be65;">"${1#*=}"</span>
        <span style="color: #c678dd;">shift</span> 1
        ;;
        --)
        <span style="color: #c678dd;">shift</span>
        <span style="color: #db5762;">CLI</span>=<span style="color: #fff0f5;">(</span><span style="color: #98be65;">"$@"</span><span style="color: #fff0f5;">)</span>
        <span style="color: #51afef; font-style: italic;">break</span>
        ;;
        --help)
        usage
        ;;
        *)
        echoerr <span style="color: #98be65;">"Unknown argument: $1"</span>
        usage
        ;;
    <span style="color: #51afef; font-style: italic;">esac</span>
<span style="color: #51afef; font-style: italic;">done</span>

<span style="color: #51afef; font-style: italic;">if</span> <span style="color: #fff0f5;">[</span><span style="color: #c678dd;">[</span> <span style="color: #98be65;">"$HOST"</span> == <span style="color: #98be65;">""</span> || <span style="color: #98be65;">"$PORT"</span> == <span style="color: #98be65;">""</span> <span style="color: #c678dd;">]</span><span style="color: #fff0f5;">]</span>; <span style="color: #51afef; font-style: italic;">then</span>
    echoerr <span style="color: #98be65;">"Error: you need to provide a host and port to test."</span>
    usage
<span style="color: #51afef; font-style: italic;">fi</span>

<span style="color: #db5762;">TIMEOUT</span>=$<span style="color: #fff0f5;">{</span><span style="color: #db5762;">TIMEOUT</span>:-15<span style="color: #fff0f5;">}</span>
<span style="color: #db5762;">STRICT</span>=$<span style="color: #fff0f5;">{</span><span style="color: #db5762;">STRICT</span>:-0<span style="color: #fff0f5;">}</span>
<span style="color: #db5762;">CHILD</span>=$<span style="color: #fff0f5;">{</span><span style="color: #db5762;">CHILD</span>:-0<span style="color: #fff0f5;">}</span>
<span style="color: #db5762;">QUIET</span>=$<span style="color: #fff0f5;">{</span><span style="color: #db5762;">QUIET</span>:-0<span style="color: #fff0f5;">}</span>

<span style="color: #5B6268;"># </span><span style="color: #5B6268;">check to see if timeout is from busybox?</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">check to see if timeout is from busybox?</span>
<span style="color: #db5762;">TIMEOUT_PATH</span>=$<span style="color: #fff0f5;">(</span><span style="color: #51afef; font-weight: bold;">realpath</span> $<span style="color: #c678dd;">(</span><span style="color: #51afef; font-weight: bold;">which</span> timeout<span style="color: #c678dd;">)</span><span style="color: #fff0f5;">)</span>
<span style="color: #51afef; font-style: italic;">if</span> <span style="color: #fff0f5;">[</span><span style="color: #c678dd;">[</span> $<span style="color: #db5762;">TIMEOUT_PATH</span> =~ <span style="color: #98be65;">"busybox"</span> <span style="color: #c678dd;">]</span><span style="color: #fff0f5;">]</span>; <span style="color: #51afef; font-style: italic;">then</span>
        <span style="color: #db5762;">ISBUSY</span>=1
        <span style="color: #db5762;">BUSYTIMEFLAG</span>=<span style="color: #98be65;">"-t"</span>
<span style="color: #51afef; font-style: italic;">else</span>
        <span style="color: #db5762;">ISBUSY</span>=0
        <span style="color: #db5762;">BUSYTIMEFLAG</span>=<span style="color: #98be65;">""</span>
<span style="color: #51afef; font-style: italic;">fi</span>

<span style="color: #51afef; font-style: italic;">if</span> <span style="color: #fff0f5;">[</span><span style="color: #c678dd;">[</span> $<span style="color: #db5762;">CHILD</span> -gt 0 <span style="color: #c678dd;">]</span><span style="color: #fff0f5;">]</span>; <span style="color: #51afef; font-style: italic;">then</span>
    wait_for
    <span style="color: #db5762;">RESULT</span>=$<span style="color: #db5762;">?</span>
    <span style="color: #51afef; font-style: italic;">exit</span> $<span style="color: #db5762;">RESULT</span>
<span style="color: #51afef; font-style: italic;">else</span>
    <span style="color: #51afef; font-style: italic;">if</span> <span style="color: #fff0f5;">[</span><span style="color: #c678dd;">[</span> $<span style="color: #db5762;">TIMEOUT</span> -gt 0 <span style="color: #c678dd;">]</span><span style="color: #fff0f5;">]</span>; <span style="color: #51afef; font-style: italic;">then</span>
        wait_for_wrapper
        <span style="color: #db5762;">RESULT</span>=$<span style="color: #db5762;">?</span>
    <span style="color: #51afef; font-style: italic;">else</span>
        wait_for
        <span style="color: #db5762;">RESULT</span>=$<span style="color: #db5762;">?</span>
    <span style="color: #51afef; font-style: italic;">fi</span>
<span style="color: #51afef; font-style: italic;">fi</span>

<span style="color: #51afef; font-style: italic;">if</span> <span style="color: #fff0f5;">[</span><span style="color: #c678dd;">[</span> $<span style="color: #db5762;">CLI</span> != <span style="color: #98be65;">""</span> <span style="color: #c678dd;">]</span><span style="color: #fff0f5;">]</span>; <span style="color: #51afef; font-style: italic;">then</span>
    <span style="color: #51afef; font-style: italic;">if</span> <span style="color: #fff0f5;">[</span><span style="color: #c678dd;">[</span> $<span style="color: #db5762;">RESULT</span> -ne 0 &amp;&amp; $<span style="color: #db5762;">STRICT</span> -eq 1 <span style="color: #c678dd;">]</span><span style="color: #fff0f5;">]</span>; <span style="color: #51afef; font-style: italic;">then</span>
        echoerr <span style="color: #98be65;">"$cmdname: strict mode, refusing to execute subprocess"</span>
        <span style="color: #51afef; font-style: italic;">exit</span> $<span style="color: #db5762;">RESULT</span>
    <span style="color: #51afef; font-style: italic;">fi</span>
    <span style="color: #51afef; font-style: italic;">exec</span> <span style="color: #98be65;">"${CLI[@]}"</span>
<span style="color: #51afef; font-style: italic;">else</span>
    <span style="color: #51afef; font-style: italic;">exit</span> $<span style="color: #db5762;">RESULT</span>
<span style="color: #51afef; font-style: italic;">fi</span>

</pre>
</div>


<script src="../../assets/jquery-3.3.1.min.js"></script>
<script src="../../assets/notes.js"></script>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-04-21 Sat 14:41</p>
<p class="author">Author: Damian Chrzanowski</p>
<p class="date">Created: 2019-08-07 Wed 22:20</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
